brew "asciinema"
brew "agg"
brew "bat"
brew "cloudflare-wrangler"
brew "csvlens"
brew "devcontainer"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gum"
brew "httpie"
brew "jless"
brew "jq"
brew "ripgrep"
brew "slides"
brew "starship"
brew "stellar-cli"
brew "tig"
brew "tmux"
brew "tree"
brew "watchexec"
brew "zstd"

brew "node"
brew "deno"
brew "sccache"
brew "rustup"
brew "go"
brew "uv"

brew "neovim"
brew "lua-language-server"
brew "rust-analyzer"
brew "vscode-langservers-extracted"
brew "gopls"

brew "gemini-cli"

if OS.mac?
  brew "act"
  brew "autoconf"
  brew "automake"
  brew "clang-format"
  brew "cmake"
  brew "colima"
  brew "coreutils"
  brew "docker"
  brew "docker-credential-helper"
  brew "docker-buildx"
  brew "duckdb"
  brew "ffmpeg"
  brew "flyctl"
  brew "glow"
  brew "imagemagick"
  brew "mas"
  brew "stellar-core"
  brew "zig"
  brew "zls"
  brew "wabt"
  brew "wasm-pack"
  brew "vhs"

  cask "font-fira-code"
  cask "font-fira-code-nerd-font"

  cask "chatgpt"
  cask "claude"
  cask "descript"
  cask "thebrowsercompany-dia"
  cask "discord"
  cask "doxie"
  cask "ghostty"
  cask "sublime-text"
#  cask "visual-studio-code@insiders"
  cask "obsidian"
  cask "obs"

  cask "motion"

  mas "1Blocker", id: 1365531024
  mas "1Password for Safari", id: 1569813296
  mas "House Designer", id: 779363176
  mas "Numbers", id: 409203825
  mas "Pages", id: 409201541
  mas "Perplexity", id: 6714467650
  mas "Prime Video", id: 545519333
  mas "Tailscale", id: 1475387142
  mas "Telegram", id: 747648890
  mas "WhatsApp", id: 310633997
  mas "Slack", id: 803453959
  mas "Calm Radio", id: 112902545
  mas "Plash", id: 1494023538
  mas "Day Progress", id: 6450280202

  mas "BloonsTD6+", id: 1584423325
  mas "Boggle: Arcade Edition", id: 6453020941
  mas "Boop", id: 1518425043
  mas "Cypher", id: 1586958842
  mas "Spire Blast", id: 1532717034
  mas "Mini Motorways", id: 1456188526
  mas "LEGO Star Wars Battles", id: 1563174698
  mas "Kingdom Rush Frontiers+", id: 1579364157
  mas "Kingdom Rush Vengeance+", id: 1610130712
  mas "Iron Marines+", id: 1670387512
  mas "junkworld", id: 6448185316
  mas "Samorost 3+", id: 1611529849
  mas "Skate City NY", id: 6448986810
end
